docker/.bench_tmp/dragonfly_GET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   9 secs]  0 threads 50 conns:    20000000 ops, 2253266 (avg: 2206179) ops/sec, 227.77MB/sec (avg: 223.01MB/sec),  1.41 (avg:  1.44) msec latency


CPU Utilization Summary
  Total CPU time:   31.007s  (user 19.807s, sys 11.200s)
  Wall time:        9.117s
  Cores used:       3.401   (avg 85.0% across 4 worker threads)
  Peak utilization: 352.7%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets      2203727.56   2203727.56         0.00         1.44518         1.31100         4.63900         9.85500    228104.80 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2203727.56   2203727.56         0.00         1.44518         1.31100         4.63900         9.85500    228104.80