docker/.bench_tmp/dragonfly_MIXED.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   8 secs]  0 threads 50 conns:    20000000 ops, 2281856 (avg: 2273250) ops/sec, 232.83MB/sec (avg: 231.95MB/sec),  1.40 (avg:  1.40) msec latency

4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       456396.71          ---          ---         1.40262         1.30300         3.87100         9.15100     49469.51 
Gets      1825586.85   1825586.85         0.00         1.40249         1.30300         3.87100         9.15100    188963.96 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2281983.57   1825586.85         0.00         1.40251         1.30300         3.87100         9.15100    238433.47 

CPU Utilization Summary
  Total CPU time:   31.381s  (user 20.089s, sys 11.293s)
  Wall time:        8.894s
  Cores used:       3.528   (avg 88.2% across 4 worker threads)
  Peak utilization: 371.4%