docker/.bench_tmp/dragonfly_SET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 50 conns:    20000000 ops, 1442057 (avg: 1962893) ops/sec, 152.64MB/sec (avg: 207.77MB/sec),  2.26 (avg:  1.63) msec latency


CPU Utilization Summary
  Total CPU time:   35.077s  (user 21.442s, sys 13.635s)
  Wall time:        10.352s
  Cores used:       3.388   (avg 84.7% across 4 worker threads)
  Peak utilization: 363.1%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1965010.82          ---          ---         1.62589         1.40700         6.49500        16.51100    212990.34 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1965010.82         0.00         0.00         1.62589         1.40700         6.49500        16.51100    212990.34