docker/.bench_tmp/kachedb_GET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  13 secs]  0 threads 50 conns:    20000000 ops, 1577429 (avg: 1522833) ops/sec, 63.93MB/sec (avg: 62.64MB/sec),  2.02 (avg:  2.10) msec latency

warning: GET miss rate 95.24% above target 1.00% (19048466 misses / 20000000 ops)

CPU Utilization Summary
  Total CPU time:   32.977s  (user 16.108s, sys 16.868s)
  Wall time:        13.178s
  Cores used:       2.502   (avg 62.5% across 4 worker threads)
  Peak utilization: 260.6%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets      1521147.60     72371.18   1448776.42         2.09627         1.99900         4.63900        16.51100     64073.72 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1521147.60     72371.18   1448776.42         2.09627         1.99900         4.63900        16.51100     64073.72