docker/.bench_tmp/kachedb_MIXED.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #1)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #1)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #1)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #1)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #2)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #2)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #2)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #2)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #3)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #3)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #3)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #3)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #4)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #4)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #4)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #4)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #5)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #5)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #5)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #5)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
[RUN #1 0%,   1 secs]  0 threads 50 conns 4 conn errors:         816 ops,       0 (avg:     813) ops/sec, 0.00KB/sec (avg: 54.40KB/sec),   nan (avg: 11.47) msec latency

warning: GET miss rate 73.95% above target 1.00% (477 misses / 645 ops)

CPU Utilization Summary
  Total CPU time:   0.127s  (user 0.051s, sys 0.076s)
  Wall time:        0.213s
  Cores used:       0.599   (avg 6.2% across 4 worker threads)
  Peak utilization: 2.0%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---        13.30161         2.04700        43.77500        43.77500         0.00 
Gets            0.00         0.00         0.00        10.99101         2.03900        43.77500        43.77500         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals          0.00         0.00         0.00        11.47522         2.03900        43.77500        43.77500         0.00